require 'rubygems'
require 'rack'
require 'camping'
$KANJI="一右雨円王音下火花学気九休金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早足村大男中虫町天田土二日入年白八百文木本名目立力林六引雲遠何科夏家歌画回会海絵貝外間顔汽記帰牛魚京強教玉近形計元原戸古午後語工広交光考行高黄合谷国黒今才作算止市思紙寺自時室社弱首秋春書少場色食心新親図数西声星晴切雪船前組走草多太体台地池知竹茶昼長鳥朝通弟店点電刀冬当東答頭同道読南馬売買麦半番父風分聞米歩母方北毎妹明鳴毛門夜野友用曜来楽里理話悪安暗医意育員院飲運泳駅園横屋温化荷界開階角活寒感館岸岩起期客究急級宮球去橋業曲局銀苦具君兄係軽血決研県言庫湖公向幸港号根祭細仕死使始指歯詩次事持式実写者主守取酒受州拾終習週集住重所暑助昭消商章勝乗植申身神深進世整線全送息族他打対待代第題炭短着注柱丁帳調直追定庭鉄転都度投島湯登等動童内肉農波配畑発反坂板皮悲美鼻氷表秒病品負部服福物平返勉放万味命面問役薬由油有遊予洋葉陽様落流旅両緑礼列路和愛案以衣位囲委胃印英栄塩央億加貨課芽改械害各覚完官漢管関観願希季紀喜旗器機議求救給挙漁共協鏡競極区軍郡型景芸欠結建健験固功候航康告差菜最材昨刷殺察参産散残士氏史司姉試辞失借種周宿順初唱焼照賞臣信真成省清勢静席積折節説浅戦選然争相倉想象速側続卒孫帯隊達単談治置貯腸低底停的典伝徒努灯堂働毒熱念敗倍博飯飛費必筆票標不夫付府副粉兵別辺変便包法望牧末満脈民約勇要養浴利陸良料量輪類令冷例歴連練老労録圧移因永営衛易益液演応往恩仮価果河過賀快解格確額刊幹慣歓眼基寄規技義逆久旧居許境興均禁句訓群経潔件券険検絹限現減故個護効厚耕鉱構講混査再災妻採際在財罪雑蚕酸賛支志師資示似児識質舎謝授収修衆祝述術準序除招承称証条状常情織職制性政精製税責績接設舌絶銭善祖素総造像増則測属損退貸態団断築張提程適敵統銅導特得徳独任燃能破犯判版比肥非備俵評貧布婦富武復複仏編弁保墓報豊防貿暴未務無迷綿輸余預容率略留領異遺域壱宇羽映延沿可我灰街拡革閣割株干巻看勧簡丸危机揮貴疑弓吸泣供胸郷勤筋系径敬警劇穴兼権憲源厳己呼誤后好孝皇紅降鋼刻穀骨困砂座済裁策冊至私姿視詞誌磁射捨尺釈若需樹宗就従縦縮熟純処署諸将笑傷障城蒸針仁垂推寸是聖誠宣専泉洗染奏窓創層操蔵臓俗存尊宅担探段暖値仲宙忠著庁兆頂潮賃痛展討党糖届難弐乳認納脳派拝背肺俳班晩否批秘腹奮陛閉片補宝訪亡忘棒枚幕密盟模矢訳郵優幼羊欲翌乱卵覧裏律臨朗論亜哀握扱依威為尉偉違維慰緯逸芋姻陰隠韻詠影鋭疫悦越謁閲炎宴援煙猿鉛縁汚凹押欧殴桜翁奥憶虞乙卸穏佳架華菓渦嫁暇禍靴寡箇稼蚊雅餓介戒怪拐悔皆塊壊懐劾涯慨該概垣核殻郭較隔獲嚇穫岳掛潟括喝渇滑褐轄且刈甘汗缶肝冠陥乾勘患貫喚堪換敢棺款閑寛監緩憾還環艦鑑含頑企岐忌奇祈軌既飢鬼幾棋棄輝騎宜偽欺儀戯擬犠菊吉喫詰却脚虐及丘朽糾窮巨拒拠虚距御凶叫狂享況峡挟狭恐恭脅矯響驚仰暁凝斤菌琴緊謹襟吟駆愚偶遇隅屈掘繰勲薫刑茎契恵啓掲渓蛍傾携継慶憩鶏迎鯨撃激傑肩倹剣軒圏堅嫌献遣賢謙繭顕懸幻玄弦孤弧枯雇誇鼓顧互呉娯悟碁孔巧甲江坑抗攻更拘肯恒洪荒郊香侯貢控慌硬絞項溝綱酵稿衡購拷剛豪克酷獄込昆恨婚紺魂墾懇佐唆詐鎖砕宰栽彩斎債催歳載剤崎削索酢搾錯咲札撮擦皿桟惨傘暫旨伺刺枝祉肢施脂紫嗣飼雌賜諮侍滋慈璽軸疾執湿漆芝赦斜煮遮邪蛇勺酌爵寂朱狩殊珠趣寿儒囚舟秀臭愁酬醜襲汁充柔渋銃獣叔淑粛塾俊瞬旬巡盾准殉循潤遵庶緒如叙徐升召匠床抄肖尚昇松沼宵症祥渉紹訟掌晶焦硝粧詔奨詳彰衝償礁鐘丈冗浄剰畳縄壌嬢錠譲醸殖飾触嘱辱伸辛侵津唇娠振浸紳診寝慎審震薪刃尽迅甚陣尋吹炊帥粋衰酔遂睡穂錘随髄枢崇据杉畝瀬井姓征斉牲逝盛婿誓請斥昔析隻惜跡籍拙窃摂仙占扇栓旋践銑潜遷薦繊鮮禅漸繕阻租措粗疎訴塑礎双壮荘捜挿桑掃曹巣喪葬装僧遭槽燥霜騒藻憎贈即束促賊妥堕惰駄耐怠胎泰袋逮替滞滝択沢卓拓託濯諾濁但脱奪棚丹胆淡嘆端誕鍛弾壇恥致遅痴稚畜逐蓄秩窒嫡沖抽衷鋳駐弔挑彫眺釣脹超跳徴澄聴懲勅沈珍朕陳鎮墜塚漬坪廷呈抵邸亭貞帝訂逓偵堤艇締泥笛摘滴迭哲徹撤添殿斗吐途渡塗奴怒豆到逃倒凍唐桃透悼盗陶塔搭棟痘筒稲踏謄闘騰洞胴峠匿督篤凸突屯豚鈍曇軟尼尿妊忍寧粘悩濃把覇婆杯排廃輩梅培陪媒賠伯拍泊迫舶薄漠縛爆箱肌鉢髪伐抜罰閥帆伴畔般販搬煩頒範繁藩蛮盤妃彼披卑疲被扉碑罷避尾微匹泌姫漂苗描猫浜賓頻敏瓶扶怖附赴浮符普腐敷膚賦譜侮舞封伏幅覆払沸紛雰噴墳憤丙併並柄塀幣弊壁癖偏遍捕浦舗募慕暮簿芳邦奉抱泡胞俸倣峰砲崩飽褒縫乏忙坊妨房肪某冒剖紡傍帽膨謀朴僕墨撲没堀奔翻凡盆麻摩磨魔埋膜又抹慢漫魅岬妙眠矛夢霧娘銘滅免茂妄盲耗猛網黙紋匁厄躍愉諭癒唯幽悠猶裕雄誘憂融与誉庸揚揺溶腰踊窯擁謡抑翼裸羅雷頼絡酪濫欄吏痢履離柳竜粒隆硫虜慮了涼猟陵僚寮療糧厘倫隣涙累塁励戻戻鈴零霊隷齢麗暦劣烈裂恋廉錬炉露郎浪廊楼漏賄惑枠湾腕"
$START_DAY = 118
$KCODE = 'u'
Camping.goes :Kanji
 module Kanji::Controllers
   class Stylesheet < R '/kanji.css'
     def get
       @headers['Content-Type'] = 'text/css'
       ".blue {color: blue} .red {color: red}"
     end
   end
   class Index < R '/'
     def get
       @kanjis = []
       @i = 0
       $KANJI.each_char do |c|
         
         @kanjis << c
         @i = @i + 1
       end
       render :index
     end
   end
 end

 module Kanji::Views
   def layout
     html do
       body do
         self << yield
       end
     end
   end

   def index
     link :href => R(Stylesheet), :rel => 'stylesheet', :type => 'text/css'
     @kanjis.each_index do |k|
       status = (k/10 - Time.now.strftime("%j").to_i + $START_DAY)
         if status < 0  
           color = :black
         elsif status == 0
           color = :red
         else
           color = :blue           
         end
       if k%10 == 0 then
         h1 :class => color do
           "Set #{k/10+1}"
         end
       end
       span @kanjis[k] 
     end
   end
 end

Rack::Adapter::Camping.new(Kanji)